Documents/Лео_УстановкаСкидкиОтБазовыеЦены/Лео_УстановкаСкидкиОтБазовыеЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лео_УстановкаСкидкиОтБазовыеЦены</name>
  <registerRecords>InformationRegister.Лео_СкидкиОтБазовыеЦены</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>ДатаНачалаПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦенНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатуснаяСкидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительнаяСкидка</name>
      <comment>Дополнительная скидка (за предоплату), (применяется последовательно 1.1.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусныйТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦенНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаКомпенсирующаяПремию</name>
      <comment>Скидка, компенсирующая премию (применяется параллельно 1.2.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаЗаУслугиЛогистики</name>
      <comment>Скидка за услуги логистики (применяется параллельно 1.2.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаЗаУслугиТорговогоМаркетинга</name>
      <comment>Скидка за услуги торгового маркетинга (применяется параллельно 1.2.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаЗаУслугиМерчендайзинга</name>
      <comment>Скидка за услуги мерчендайзинга (применяется параллельно 1.2.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаЗаПрочиеУслугиПоДоговору</name>
      <comment>Скидка за прочие услуги по договору (применяется параллельно 1.2.)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦенСоСкидкой</name>
      <type>
        <types>CatalogRef.ТипыЦенНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументУстановкаТиповЦенПоГруппам</name>
      <type>
        <types>DocumentRef.УстановкаТиповЦенПоГруппамНоменклатурыДляПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>СоздатьТипыЦен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СоздатьПривязкуТипаЦенКДоговору</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

InformationRegisters/Лео_СкидкиОтБазовыеЦены/Лео_СкидкиОтБазовыеЦены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_СкидкиОтБазовыеЦены</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазовыйТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СтатуснаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительнаяСкидка</name>
    <comment>Дополнительная скидка (за предоплату), (применяется последовательно 1.1.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтатусныйТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СкидкаКомпенсирующаяПремию</name>
    <comment>Скидка, компенсирующая премию (применяется параллельно 1.2.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкидкаЗаУслугиЛогистики</name>
    <comment>Скидка за услуги логистики (применяется параллельно 1.2.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкидкаЗаУслугиТорговогоМаркетинга</name>
    <comment>Скидка за услуги торгового маркетинга (применяется параллельно 1.2.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкидкаЗаУслугиМерчендайзинга</name>
    <comment>Скидка за услуги мерчендайзинга (применяется параллельно 1.2.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкидкаЗаПрочиеУслугиПоДоговору</name>
    <comment>Скидка за прочие услуги по договору (применяется параллельно 1.2.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипЦенСоСкидкой</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/Лео_УстановкаСкидкиОтБазовыеЦены/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Лео_СкидкиОтБазовыеЦены.Записывать = Истина;
	Движения.Лео_СкидкиОтБазовыеЦены.Очистить();
	Для Каждого ТекСтрокаСкидки Из Скидки Цикл
		Движение = Движения.Лео_СкидкиОтБазовыеЦены.Добавить();
		Движение.Период = Дата;
		Движение.Договор = Договор;
		Движение.Период = ТекСтрокаСкидки.ДатаНачалаПериода;
		Движение.ОкончаниеПериода = ТекСтрокаСкидки.ОкончаниеПериода;
		Движение.БазовыйТипЦен = ТекСтрокаСкидки.БазовыйТипЦен;
		Движение.СтатуснаяСкидка = ТекСтрокаСкидки.СтатуснаяСкидка;
		Движение.ДополнительнаяСкидка = ТекСтрокаСкидки.ДополнительнаяСкидка;
		Движение.СкидкаКомпенсирующаяПремию = ТекСтрокаСкидки.СкидкаКомпенсирующаяПремию;
		Движение.СкидкаЗаУслугиЛогистики = ТекСтрокаСкидки.СкидкаЗаУслугиЛогистики;
		Движение.СкидкаЗаУслугиТорговогоМаркетинга = ТекСтрокаСкидки.СкидкаЗаУслугиТорговогоМаркетинга;
		Движение.СкидкаЗаУслугиМерчендайзинга = ТекСтрокаСкидки.СкидкаЗаУслугиМерчендайзинга;
		Движение.СкидкаЗаПрочиеУслугиПоДоговору = ТекСтрокаСкидки.СкидкаЗаПрочиеУслугиПоДоговору;
		Движение.ТипЦенСоСкидкой = ТекСтрокаСкидки.ТипЦенСоСкидкой;
		Движение.СтатусныйТипЦен = ТекСтрокаСкидки.СтатусныйТипЦен;
		Движение.Комментарий = ТекСтрокаСкидки.Комментарий;

	КонецЦикла;

КонецПроцедуры
